BPI-SINOVOIP/BPI-M4-bsp/phoenix/system/src/drivers/wifi/rtl8723de/hal/rtl8723d/pci/pci_halinit.c
		}
	}
	RTW_INFO("MGNT Customer ID: 0x%2x\n", pHalData->CustomerID);

	hal_CustomizedBehavior_8723DE(pAdapter);
}


static void
InitAdapterVariablesByPROM_8723DE(
		PADAPTER	Adapter
)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(Adapter);
	/* RTW_INFO("InitAdapterVariablesByPROM_8723DE()!!\n"); */

	Hal_InitPGData(Adapter, pHalData->efuse_eeprom_data);
	Hal_EfuseParseIDCode(Adapter, pHalData->efuse_eeprom_data);

	Hal_EfuseParseEEPROMVer_8723D(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);
	hal_ReadIDs_8723DE(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);
	hal_config_macaddr(Adapter, pHalData->bautoload_fail_flag);
	Hal_EfuseParseTxPowerInfo_8723D(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);
	Hal_ReadEfusePCIeCap8723DE(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);

	/* */
	/* Read Bluetooth co-exist and initialize */
	/* */
	Hal_EfuseParseBTCoexistInfo_8723D(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);

	Hal_EfuseParseChnlPlan_8723D(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);
	Hal_EfuseParseXtal_8723D(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);
	Hal_EfuseParseThermalMeter_8723D(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);
	Hal_EfuseParseAntennaDiversity_8723D(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);
	hal_CustomizeByCustomerID_8723DE(Adapter);

#ifdef CONFIG_RF_POWER_TRIM
	Hal_ReadRFGainOffset(Adapter, pHalData->efuse_eeprom_data, pHalData->bautoload_fail_flag);
#endif	/* CONFIG_RF_GAIN_OFFSET */

	/* set coex. ant info once efuse parsing is done */
	rtw_btcoex_set_ant_info(Adapter);

	hal_read_mac_hidden_rpt(Adapter);
}

static void
Hal_ReadPROMContent_8723DE(
		PADAPTER			Adapter
)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(Adapter);
	u8			eeValue;


	eeValue = rtw_read8(Adapter, REG_9346CR);
	/* To check system boot selection. */
	pHalData->EepromOrEfuse		= (eeValue & BOOT_FROM_EEPROM) ? _TRUE : _FALSE;
	pHalData->bautoload_fail_flag	= (eeValue & EEPROM_EN) ? _FALSE : _TRUE;

	RTW_INFO("Boot from %s, Autoload %s !\n", (pHalData->EepromOrEfuse ? "EEPROM" : "EFUSE"),
		 (pHalData->bautoload_fail_flag ? "Fail" : "OK"));

	/* pHalData->EEType = IS_BOOT_FROM_EEPROM(Adapter) ? EEPROM_93C46 : EEPROM_BOOT_EFUSE; */

	InitAdapterVariablesByPROM_8723DE(Adapter);
}

static void ReadRFType8723DE(PADAPTER padapter)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);

#if DISABLE_BB_RF
	pHalData->rf_chip = RF_PSEUDO_11N;
	pHalData->rf_type = RF_1T1R;
#else
	pHalData->rf_chip = RF_6052;
	pHalData->rf_type = RF_1T1R;
#endif
}

static u8 ReadAdapterInfo8723DE(PADAPTER Adapter)
{
	/* Read EEPROM size before call any EEPROM function */
	Adapter->EepromAddressSize = GetEEPROMSize8723D(Adapter);
	#ifdef CONFIG_RF_SHADOW_RW
	/* For debug test now!!!!! */
	PHY_RFShadowRefresh(Adapter);
	#endif
	/* Read all content in Efuse/EEPROM.	*/
	Hal_ReadPROMContent_8723DE(Adapter);

	Hal_ReadPROMContent_BT_8723DE(Adapter);

	/* We need to define the RF type after all PROM value is recognized. */
	ReadRFType8723DE(Adapter);

	return _SUCCESS;
}


void rtl8723de_interface_configure(PADAPTER Adapter)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	struct dvobj_priv	*pdvobjpriv = adapter_to_dvobj(Adapter);
	struct pwrctrl_priv	*pwrpriv = adapter_to_pwrctl(Adapter);
	u16 val_16 = 0;
	u8 ClkDelayCount = 4;	/* default: 4, range: 0~15 */

	/* /close ASPM for AMD defaultly */
	pdvobjpriv->const_amdpci_aspm = 0;

	/* / ASPM PS mode. */
	/* / 0 - Disable ASPM, 1 - Enable ASPM without Clock Req, */
	/* / 2 - Enable ASPM with Clock Req, 3- Alwyas Enable ASPM with Clock Req, */
	/* / 4-  Always Enable ASPM without Clock Req. */
	/* / set default to rtl8188ee:3 RTL8192E:2 */
	pdvobjpriv->const_pci_aspm = 0;

	/* / Setting for PCI-E device */
	pdvobjpriv->const_devicepci_aspm_setting = 0x03;

	/* / Setting for PCI-E bridge */
	pdvobjpriv->const_hostpci_aspm_setting = 0x03;

	/* / In Hw/Sw Radio Off situation. */
	/* / 0 - Default, 1 - From ASPM setting without low Mac Pwr, */
	/* / 2 - From ASPM setting with low Mac Pwr, 3 - Bus D3 */
	/* / set default to RTL8192CE:0 RTL8192SE:2 */
	pdvobjpriv->const_hwsw_rfoff_d3 = 0;

	/* / This setting works for those device with backdoor ASPM setting such as EPHY setting. */
	/* / 0: Not support ASPM, 1: Support ASPM, 2: According to chipset. */
	pdvobjpriv->const_support_pciaspm = 1;

	pwrpriv->reg_rfoff = 0;
	pwrpriv->rfoff_reason = 0;

	pHalData->bL1OffSupport = _FALSE;
	
	if (!IS_A_CUT(pHalData->version_id) && !IS_B_CUT(pHalData->version_id)) {
		val_16 = hal_mdio_read_8723de(Adapter, 0x9);
		hal_mdio_write_8723de(Adapter, 0x9, val_16 & (~BIT14));
	}

	/*test 0x8[15:12] = 2*/
	val_16 = hal_mdio_read_8723de(Adapter, 0x8);
	val_16 &= 0x0FFF;
	val_16 |= (ClkDelayCount << 12);
	/*val_16 |=  0x2000;*/
	/*val_16 &= 0x2fff;*/
	hal_mdio_write_8723de(Adapter, 0x8, val_16);

}

void
DisableInterrupt8723DE(
		PADAPTER			Adapter
)
{
	struct dvobj_priv	*pdvobjpriv = adapter_to_dvobj(Adapter);

	rtw_write32(Adapter, REG_HIMR0_8723D, IMR_DISABLED_8723D);

	rtw_write32(Adapter, REG_HIMR1_8723D, IMR_DISABLED_8723D);	/* by tynli */

	pdvobjpriv->irq_enabled = 0;
}

void
ClearInterrupt8723DE(
		PADAPTER			Adapter
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u32	tmp = 0;

	tmp = rtw_read32(Adapter, REG_HISR0_8723D);
	rtw_write32(Adapter, REG_HISR0_8723D, tmp);
	pHalData->IntArray[0] = 0;

	tmp = rtw_read32(Adapter, REG_HISR1_8723D);
	rtw_write32(Adapter, REG_HISR1_8723D, tmp);
	pHalData->IntArray[1] = 0;

	tmp = rtw_read32(Adapter, REG_HSISR_8723D);
	rtw_write32(Adapter, REG_HSISR_8723D, tmp);
	pHalData->SysIntArray[0] = 0;
}


void
EnableInterrupt8723DE(
		PADAPTER			Adapter
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	struct dvobj_priv	*pdvobjpriv = adapter_to_dvobj(Adapter);

	pdvobjpriv->irq_enabled = 1;

	rtw_write32(Adapter, REG_HIMR0_8723D, pHalData->IntrMask[0] & 0xFFFFFFFF);

	rtw_write32(Adapter, REG_HIMR1_8723D, pHalData->IntrMask[1] & 0xFFFFFFFF);

