BPI-SINOVOIP/BPI-M4-bsp/phoenix/system/src/drivers/wifi/rtl8723de/hal/rtl8723d/pci/pci_halinit.c
	rtw_write32(Adapter, REG_HSISR_8723D, pHalData->SysIntrMask[0] & 0xFFFFFFFF);
}

BOOLEAN
InterruptRecognized8723DE(
		PADAPTER			Adapter
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	BOOLEAN			bRecognized = _FALSE;

	/* 2013.11.18 Glayrainx suggests that turn off IMR and */
	/* restore after cleaning ISR. */
	rtw_write32(Adapter, REG_HIMR0_8723D, 0);
	rtw_write32(Adapter, REG_HIMR1_8723D, 0);

	pHalData->IntArray[0] = rtw_read32(Adapter, REG_HISR0_8723D);
	pHalData->IntArray[0] &= pHalData->IntrMask[0];
	rtw_write32(Adapter, REG_HISR0_8723D, pHalData->IntArray[0]);

	/* For HISR extension. Added by tynli. 2009.10.07. */
	pHalData->IntArray[1] = rtw_read32(Adapter, REG_HISR1_8723D);
	pHalData->IntArray[1] &= pHalData->IntrMask[1];
	rtw_write32(Adapter, REG_HISR1_8723D, pHalData->IntArray[1]);

	if (((pHalData->IntArray[0]) & pHalData->IntrMask[0]) != 0 ||
	    ((pHalData->IntArray[1]) & pHalData->IntrMask[1]) != 0)
		bRecognized = _TRUE;

	rtw_write32(Adapter, REG_HIMR0_8723D, pHalData->IntrMask[0] & 0xFFFFFFFF);
	rtw_write32(Adapter, REG_HIMR1_8723D, pHalData->IntrMask[1] & 0xFFFFFFFF);

	return bRecognized;
}

void
UpdateInterruptMask8723DE(
		PADAPTER		Adapter,
		u32		AddMSR,		u32		AddMSR1,
		u32		RemoveMSR, u32		RemoveMSR1
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);

	DisableInterrupt8723DE(Adapter);

	if (AddMSR)
		pHalData->IntrMask[0] |= AddMSR;

	if (AddMSR1)
		pHalData->IntrMask[1] |= AddMSR1;

	if (RemoveMSR)
		pHalData->IntrMask[0] &= (~RemoveMSR);

	if (RemoveMSR1)
		pHalData->IntrMask[1] &= (~RemoveMSR1);

	EnableInterrupt8723DE(Adapter);
}

static void
HwConfigureRTL8723DE(
		PADAPTER			Adapter
)
{

	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u32	regRRSR = 0;


	/* 1 This part need to modified according to the rate set we filtered!! */
	/* */
	/* Set RRSR, RATR, and BW_OPMODE registers */
	/* */
	switch (pHalData->CurrentWirelessMode) {
	case WIRELESS_MODE_B:
		regRRSR = RATE_ALL_CCK;
		break;
	case WIRELESS_MODE_G:
		regRRSR = RATE_ALL_CCK | RATE_ALL_OFDM_AG;
		break;
	case WIRELESS_MODE_AUTO:
	case WIRELESS_MODE_N_24G:
		regRRSR = RATE_ALL_CCK | RATE_ALL_OFDM_AG;
		break;
	default:
		break;
	}

	/* Init value for RRSR. */
	#ifdef RTW_DYNAMIC_RRSR
		rtw_phydm_set_rrsr(Adapter, regRRSR, TRUE);
	#else
		rtw_write32(Adapter, REG_RRSR, regRRSR);
	#endif

	/* ARFB table 9 for 11ac 5G 2SS */
	rtw_write32(Adapter, REG_ARFR0_8723D, 0x00000010);
	rtw_write32(Adapter, REG_ARFR0_8723D + 4, 0x3e0ff000);

	/* ARFB table 10 for 11ac 5G 1SS */
	rtw_write32(Adapter, REG_ARFR1_8723D, 0x00000010);
	rtw_write32(Adapter, REG_ARFR1_8723D + 4, 0x000ff000);

	/* Set SLOT time Reg518 0x9 */
	rtw_write8(Adapter, REG_SLOT_8723D, 0x09);

	/* CF-End setting. */
	rtw_write16(Adapter, REG_FWHW_TXQ_CTRL_8723D, 0x1F00);

	/* Set retry limit */
	rtw_write16(Adapter, REG_RETRY_LIMIT, BIT_SRL(RL_VAL_AP) | BIT_LRL(RL_VAL_AP));

	/* BAR settings */
	rtw_write32(Adapter, REG_BAR_MODE_CTRL_8723D, 0x0201ffff);

	/* Set Data / Response auto rate fallack retry count */
	rtw_write32(Adapter, REG_DARFRC, 0x01000000);
	rtw_write32(Adapter, REG_DARFRC + 4, 0x07060504);
	rtw_write32(Adapter, REG_RARFRC, 0x01000000);
	rtw_write32(Adapter, REG_RARFRC + 4, 0x07060504);

	/* Beacon related, for rate adaptive */
	rtw_write8(Adapter, REG_ATIMWND_8723D, 0x2);

	rtw_write8(Adapter, REG_BCN_MAX_ERR_8723D, 0xff);

	/* 20100211 Joseph: Change original setting of BCN_CTRL(0x550) from */
	/* 0x1e(0x2c for test chip) ro 0x1f(0x2d for test chip). Set BIT0 of this register disable ATIM */
	/* function. Since we do not use HIGH_QUEUE anymore, ATIM function is no longer used. */
	/* Also, enable ATIM function may invoke HW Tx stop operation. This may cause ping failed */
	/* sometimes in long run test. So just disable it now. */
#ifdef CONFIG_CONCURRENT_MODE
	rtw_write16(Adapter, REG_BCN_CTRL, ((DIS_TSF_UDT | EN_BCN_FUNCTION) << 8) | DIS_TSF_UDT | EN_BCN_FUNCTION);	/* For 2 PORT TSF SYNC */
#else
	rtw_write8(Adapter, REG_BCN_CTRL, DIS_TSF_UDT | EN_BCN_FUNCTION | EN_TXBCN_RPT | DIS_ATIM);
#endif

	/* BCN_CTRL1 Reg551 0x10 */

	/* TBTT setup time */
	rtw_write8(Adapter, REG_TBTT_PROHIBIT, TBTT_PROHIBIT_SETUP_TIME);

	/* TBTT hold time: 0x540[19:8] */
	rtw_write8(Adapter, REG_TBTT_PROHIBIT + 1, TBTT_PROHIBIT_HOLD_TIME_STOP_BCN & 0xFF);
	rtw_write8(Adapter, REG_TBTT_PROHIBIT + 2,
		(rtw_read8(Adapter, REG_TBTT_PROHIBIT + 2) & 0xF0) | (TBTT_PROHIBIT_HOLD_TIME_STOP_BCN >> 8));

	/* 3 Note */
	rtw_write8(Adapter, REG_PIFS_8723D, 0);
	rtw_write8(Adapter, REG_AGGR_BREAK_TIME_8723D, 0x16);

	rtw_write16(Adapter, REG_NAV_PROT_LEN_8723D, 0x0040);
	rtw_write16(Adapter, REG_PROT_MODE_CTRL_8723D, 0x08ff);

	if (!Adapter->registrypriv.wifi_spec) {
		/* For Rx TP. Suggested by SD1 Richard. Added by tynli. 2010.04.12. */
		rtw_write32(Adapter, REG_FAST_EDCA_CTRL, 0x03086666);
	} else {
		/* For WiFi WMM. suggested by timchen. Added by tynli. */
		rtw_write32(Adapter, REG_FAST_EDCA_CTRL, 0x0);
	}

	/* ACKTO for IOT issue. */
	rtw_write8(Adapter, REG_ACKTO_8723D, 0x40);


	/* Set Spec SIFS (used in NAV) */
	/* 92d all set these register 0x1010, check it later */
	rtw_write16(Adapter, REG_SPEC_SIFS_8723D, 0x100a);
	rtw_write16(Adapter, REG_MAC_SPEC_SIFS_8723D, 0x100a);

	/* Set SIFS for CCK */
	rtw_write16(Adapter, REG_SIFS_CTX_8723D, 0x100a);

	/* Set SIFS for OFDM */
	rtw_write16(Adapter, REG_SIFS_TRX_8723D, 0x100a);



	/* 3 Note Data sheet don't define */
	rtw_write8(Adapter, 0x4C7, 0x80);

	rtw_write8(Adapter, REG_RX_PKT_LIMIT_8723D, 0x17);

	rtw_write8(Adapter, REG_MAX_AGGR_NUM_8723D, 0x0A);
	rtw_write8(Adapter, REG_AMPDU_MAX_TIME_8723D, 0x1C);

	/* Set Multicast Address. 2009.01.07. by tynli. */
	rtw_write32(Adapter, REG_MAR_8723D, 0xffffffff);
	rtw_write32(Adapter, REG_MAR_8723D + 4, 0xffffffff);

	/* end of win drv */

#if 1

	/* TXOP */
	rtw_write32(Adapter, REG_EDCA_BE_PARAM, 0x005EA42B);
	rtw_write32(Adapter, REG_EDCA_BK_PARAM, 0x0000A44F);
	rtw_write32(Adapter, REG_EDCA_VI_PARAM, 0x005EA324);
	rtw_write32(Adapter, REG_EDCA_VO_PARAM, 0x002FA226);
#endif

	/*rtw_write8(Adapter, REG_HT_SINGLE_AMPDU_8723D, 0x80);*/

	/*#if (OMNIPEEK_SNIFFER_ENABLED == 1)*/
	/* For sniffer parsing legacy rate bandwidth information
	phy_set_bb_reg(Adapter, 0x834, BIT(26), 0x0); */
	/*#endif*/

#if (HAL_MAC_ENABLE == 0)
	rtw_write32(Adapter, REG_MAR, 0xffffffff);
	rtw_write32(Adapter, REG_MAR + 4, 0xffffffff);
#endif
}

static u32 _InitPowerOn_8723DE(PADAPTER Adapter)
{
#ifdef CONFIG_BT_COEXIST
	u8 value8;
	u16 value16;
	u32 value32;
#endif
	u32	status = _SUCCESS;
	u8	tmpU1b;
	u16	tmpU2b;
	u8 bMacPwrCtrlOn = _FALSE;
	u32 tmp4Byte;

	rtw_hal_get_hwreg(Adapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
	if (bMacPwrCtrlOn == _TRUE)
		return _SUCCESS;

	rtw_write8(Adapter, REG_RSV_CTRL, 0x0);

	tmp4Byte = rtw_read32(Adapter, REG_SYS_CFG);

