BPI-SINOVOIP/BPI-M4-bsp/phoenix/system/src/drivers/wifi/rtl8723de/hal/rtl8723d/pci/pci_halinit.c
	if (tmp4Byte & BIT(24)) /* LDO */
		rtw_write8(Adapter, 0x7C, 0xC3);
	else /* SPS */
		rtw_write8(Adapter, 0x7C, 0x83);

	/* HW Power on sequence */
	if (!HalPwrSeqCmdParsing(Adapter, PWR_CUT_ALL_MSK, PWR_FAB_ALL_MSK, PWR_INTF_PCI_MSK, rtl8723D_card_enable_flow))
		return _FAIL;

	/* Release MAC IO register reset */
	tmpU1b = rtw_read8(Adapter, REG_CR);
	tmpU1b = 0xff;
	rtw_write8(Adapter, REG_CR, tmpU1b);
	rtw_mdelay_os(2);

	tmpU1b = 0x7f;
	rtw_write8(Adapter, REG_HWSEQ_CTRL, tmpU1b);
	rtw_mdelay_os(2);

	/* Add for wakeup online */
	tmpU1b = rtw_read8(Adapter, REG_SYS_CLKR);
	rtw_write8(Adapter, REG_SYS_CLKR, (tmpU1b | BIT(3)));
	tmpU1b = rtw_read8(Adapter, REG_GPIO_MUXCFG + 1);
	rtw_write8(Adapter, REG_GPIO_MUXCFG + 1, (tmpU1b & ~BIT(4)));

	/* Release MAC IO register reset */
	/* 9.	CR 0x100[7:0]	= 0xFF; */
	/* 10.	CR 0x101[1]	= 0x01; */ /* Enable SEC block */
#if 0
	rtw_write16(Adapter, REG_CR, 0x00);
	tmpU2b = rtw_read16(Adapter, REG_CR);
	tmpU2b |= (HCI_TXDMA_EN | HCI_RXDMA_EN | TXDMA_EN | RXDMA_EN
		   | PROTOCOL_EN | SCHEDULE_EN | ENSEC | CALTMR_EN
		   | MACTXEN | MACRXEN);
	rtw_write16(Adapter, REG_CR, tmpU2b);
#else
	rtw_write16(Adapter, REG_CR, 0x2ff);
#endif

	bMacPwrCtrlOn = _TRUE;
	rtw_hal_set_hwreg(Adapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);

	return status;
}

static u8
_RQPN_Init_8723DE(
		PADAPTER	Adapter,
		u32		*pNPQRQPNVaule,
		u32		*pRQPNValue
)
{
	u8			i, numNQ = 0, numPubQ = 0, numHQ = 0, numLQ = 0, numEQ = 0;
	/* u8*			numPageArray; */

	if (Adapter->registrypriv.wifi_spec) {
		numHQ = WMM_NORMAL_PAGE_NUM_HPQ_8723D;	/* 0x30 */
		numLQ = WMM_NORMAL_PAGE_NUM_LPQ_8723D;	/* 0x20 */
		numNQ = WMM_NORMAL_PAGE_NUM_NPQ_8723D;	/* 0x20 */
		numEQ = WMM_NORMAL_PAGE_NUM_EPQ_8723D;	/* 0x04 */
	} else {
		numHQ = NORMAL_PAGE_NUM_HPQ_8723D;	/* 0x0c */
		numLQ = NORMAL_PAGE_NUM_LPQ_8723D;	/* 0x02 */
		numNQ = NORMAL_PAGE_NUM_NPQ_8723D;	/* 0x02 */
		numEQ = NORMAL_PAGE_NUM_EPQ_8723D;	/* 0x00 */
	}

	numPubQ = TX_TOTAL_PAGE_NUMBER_8723D - numHQ - numLQ - numNQ - numEQ;

	*pNPQRQPNVaule = _EPQ(numEQ) | _NPQ(numNQ);
	*pRQPNValue = _HPQ(numHQ) | _LPQ(numLQ) | _PUBQ(numPubQ) | LD_RQPN;

	if (Adapter->registrypriv.wifi_spec)
		return WMM_NORMAL_TX_PAGE_BOUNDARY_8723D;
	else
		return TX_PAGE_BOUNDARY_8723D;
}
 
static s32
LLT_table_init_8723DE(
		PADAPTER	Adapter,
		u8			txpktbuf_bndy,
		u32			RQPN,
		u32			RQPN_NPQ
)
{
	u16	i, maxPage = 255;
	s32	status = _SUCCESS;

	/* 12.	TXRKTBUG_PG_BNDY 0x114[31:0] = 0x27FF00F6	/TXRKTBUG_PG_BNDY */
	rtw_write8(Adapter, REG_TRXFF_BNDY, txpktbuf_bndy);
	rtw_write16(Adapter, REG_TRXFF_BNDY + 2, RX_DMA_BOUNDARY_8723D);

	/* 13.	0x208[15:8] 0x209[7:0] = 0xF6				/ Beacon Head for TXDMA */
	rtw_write8(Adapter, REG_DWBCN0_CTRL_8723D + 1, txpktbuf_bndy);

	/* 14.	BCNQ_PGBNDY 0x424[7:0] =  0xF6				/BCNQ_PGBNDY */
	/* 2009/12/03 Why do we set so large boundary. confilct with document V11. */
	rtw_write8(Adapter, REG_BCNQ_BDNY, txpktbuf_bndy);
	rtw_write8(Adapter, REG_MGQ_BDNY, txpktbuf_bndy);

#ifdef CONFIG_CONCURRENT_MODE
	rtw_write8(Adapter, REG_BCNQ1_BDNY, txpktbuf_bndy + 8);
	rtw_write8(Adapter, REG_DWBCN1_CTRL_8723D + 1, txpktbuf_bndy + 8); /* BCN1_HEAD */
	/* BIT1- BIT_SW_BCN_SEL_EN */
	rtw_write8(Adapter, REG_DWBCN1_CTRL_8723D + 2, rtw_read8(Adapter, REG_DWBCN1_CTRL_8723D + 2) | BIT(1));
#endif

	/* 15.	WMAC_LBK_BF_HD 0x45D[7:0] =  0xF6			/WMAC_LBK_BF_HD */
	rtw_write8(Adapter, REG_WMAC_LBK_BF_HD, txpktbuf_bndy);

	/* 16.	DRV_INFO_SZ = 0x04 */
	rtw_write8(Adapter, REG_RX_DRVINFO_SZ, 0x4);

	/* auto init LLT */
	if (rtl8723d_InitLLTTable(Adapter) == _FAIL) {
		return _FAIL;
	}

	/* Set reserved page for each queue */
	/* 11.	RQPN 0x200[31:0]	= 0x80BD1C1C				/ load RQPN */
	rtw_write32(Adapter, REG_RQPN, RQPN);/* 0x80cb1010);/ 0x80711010);/0x80cb1010); */

	if (RQPN_NPQ != 0)
		rtw_write32(Adapter, REG_RQPN_NPQ, RQPN_NPQ);

	return _SUCCESS;
}

static  u32
InitMAC_8723DE(
		PADAPTER	Adapter
)
{
	u8	tmpU1b;
	u16	tmpU2b;
	struct recv_priv	*precvpriv = &Adapter->recvpriv;
	struct xmit_priv	*pxmitpriv = &Adapter->xmitpriv;
	HAL_DATA_TYPE	*pHalData	= GET_HAL_DATA(Adapter);

	RTW_INFO("=======>InitMAC_8723D()\n");

	if (rtw_hal_power_on(Adapter) == _FAIL) {
		RTW_INFO("_InitPowerOn8723DE fail\n");
		return _FAIL;
	}

	/* if(!pHalData->bMACFuncEnable) */
	{
		/* System init */
		/* 18.	LLT_table_init(Adapter); */
		u32	RQPN = 0x80EB0808;
		u32	RQPN_NPQ = 0;
		u8	TX_PAGE_BOUNDARY =
			_RQPN_Init_8723DE(Adapter, &RQPN_NPQ, &RQPN);

		if (LLT_table_init_8723DE(Adapter, TX_PAGE_BOUNDARY, RQPN, RQPN_NPQ) == _FAIL)
			return _FAIL;
	}

	/* Enable Host Interrupt */
	rtw_write32(Adapter, REG_HISR0_8723D, 0xffffffff);
	rtw_write32(Adapter, REG_HISR1_8723D, 0xffffffff);


	tmpU2b = rtw_read16(Adapter, REG_TRXDMA_CTRL);
	tmpU2b &= 0xf;
	if (Adapter->registrypriv.wifi_spec)
		tmpU2b |= 0xF9B1;
	else
		tmpU2b |= 0xC5A0;	/* HIQ->HPQ, MGQ->EPQ, BKQ->LPQ, BEQ->LPQ, VIQ->NPQ, VOQ->NPQ */
	rtw_write16(Adapter, REG_TRXDMA_CTRL, tmpU2b);


	/* Reported Tx status from HW for rate adaptive. */
	/* 2009/12/03 MH This should be realtive to power on step 14. But in document V11 */
	/* still not contain the description.!!! */
	rtw_write8(Adapter, REG_FWHW_TXQ_CTRL + 1, 0x1F);

	/* Set RCR register */
	rtw_hal_set_hwreg(Adapter, HW_VAR_RCR, (u8 *)&pHalData->ReceiveConfig);
	rtw_write16(Adapter, REG_RXFLTMAP0, 0xFFFF);
	rtw_write16(Adapter, REG_RXFLTMAP1, 0x400);
	rtw_write16(Adapter, REG_RXFLTMAP2, 0xFFFF);
	/* Set TCR register */
	rtw_write32(Adapter, REG_TCR, pHalData->TransmitConfig);

	/* */
	/* Set TX/RX descriptor physical address(from OS API). */
	/* */
	rtw_write32(Adapter, REG_BCNQ_TXBD_DESA_8723D, (u64)pxmitpriv->tx_ring[BCN_QUEUE_INX].dma & DMA_BIT_MASK(32));
	rtw_write32(Adapter, REG_MGQ_TXBD_DESA_8723D, (u64)pxmitpriv->tx_ring[MGT_QUEUE_INX].dma & DMA_BIT_MASK(32));
	rtw_write32(Adapter, REG_VOQ_TXBD_DESA_8723D, (u64)pxmitpriv->tx_ring[VO_QUEUE_INX].dma & DMA_BIT_MASK(32));
	rtw_write32(Adapter, REG_VIQ_TXBD_DESA_8723D, (u64)pxmitpriv->tx_ring[VI_QUEUE_INX].dma & DMA_BIT_MASK(32));
	rtw_write32(Adapter, REG_BEQ_TXBD_DESA_8723D, (u64)pxmitpriv->tx_ring[BE_QUEUE_INX].dma & DMA_BIT_MASK(32));
	rtw_write32(Adapter, REG_BKQ_TXBD_DESA_8723D, (u64)pxmitpriv->tx_ring[BK_QUEUE_INX].dma & DMA_BIT_MASK(32));
	rtw_write32(Adapter, REG_HI0Q_TXBD_DESA_8723D, (u64)pxmitpriv->tx_ring[HIGH_QUEUE_INX].dma & DMA_BIT_MASK(32));
	rtw_write32(Adapter, REG_RXQ_RXBD_DESA_8723D, (u64)precvpriv->rx_ring[RX_MPDU_QUEUE].dma & DMA_BIT_MASK(32));

#ifdef CONFIG_64BIT_DMA
	/* 2009/10/28 MH For DMA 64 bits. We need to assign the high 32 bit address */
	/* for NIC HW to transmit data to correct path. */
	rtw_write32(Adapter, REG_BCNQ_TXBD_DESA_8723D + 4,
		    ((u64)pxmitpriv->tx_ring[BCN_QUEUE_INX].dma) >> 32);
	rtw_write32(Adapter, REG_MGQ_TXBD_DESA_8723D + 4,
		    ((u64)pxmitpriv->tx_ring[MGT_QUEUE_INX].dma) >> 32);
	rtw_write32(Adapter, REG_VOQ_TXBD_DESA_8723D + 4,
		    ((u64)pxmitpriv->tx_ring[VO_QUEUE_INX].dma) >> 32);
	rtw_write32(Adapter, REG_VIQ_TXBD_DESA_8723D + 4,
		    ((u64)pxmitpriv->tx_ring[VI_QUEUE_INX].dma) >> 32);
	rtw_write32(Adapter, REG_BEQ_TXBD_DESA_8723D + 4,
		    ((u64)pxmitpriv->tx_ring[BE_QUEUE_INX].dma) >> 32);
	rtw_write32(Adapter, REG_BKQ_TXBD_DESA_8723D + 4,
		    ((u64)pxmitpriv->tx_ring[BK_QUEUE_INX].dma) >> 32);
	rtw_write32(Adapter, REG_HI0Q_TXBD_DESA_8723D + 4,
		    ((u64)pxmitpriv->tx_ring[HIGH_QUEUE_INX].dma) >> 32);
	rtw_write32(Adapter, REG_RXQ_RXBD_DESA_8723D + 4,
		    ((u64)precvpriv->rx_ring[RX_MPDU_QUEUE].dma) >> 32);

#if 1
	/* Don't check dma addr, just depends on PCI-host setting */
	if (Adapter->dvobj->bdma64) {
		RTW_INFO("Enable DMA64 bit\n");

		PlatformEnableDMA64(Adapter);
	}
#else
	/* check dma addr, and it may fallback to 32bit mode */

	/* 2009/10/28 MH If RX descriptor address is not equal to zero. We will enable */
	/* DMA 64 bit functuion. */
	/* Note: We never saw thd consition which the descripto address are divided into */
	/* 4G down and 4G upper separate area. */
	if (((u64)precvpriv->rx_ring[RX_MPDU_QUEUE].dma) >> 32 != 0) {
		/* RTW_INFO("RX_DESC_HA=%08lx\n", ((u64)priv->rx_ring_dma[RX_MPDU_QUEUE])>>32); */
		RTW_INFO("Enable DMA64 bit\n");

		/* Check if other descriptor address is zero and abnormally be in 4G lower area. */
		if (((u64)pxmitpriv->tx_ring[MGT_QUEUE_INX].dma) >> 32) {
			/* */
			RTW_INFO("MGNT_QUEUE HA=0\n");
		}

		PlatformEnableDMA64(Adapter);
	} else {
		struct pci_dev *pdev = Adapter->dvobj->ppcidev;

		RTW_INFO("Enable DMA32 bit (fallback)\n");

		if (!pci_set_dma_mask(pdev, DMA_BIT_MASK(32))) {
			if (pci_set_consistent_dma_mask(pdev, DMA_BIT_MASK(32)) != 0)
				RTW_INFO(KERN_ERR "Unable to obtain 32bit DMA for consistent allocations\n");
		}
	}
#endif
#endif

	/* Reset the Read/Write point to 0 */
	rtw_write32(Adapter, REG_BD_RW_PTR_CLR_8723D, 0X3FFFFFFF);

	tmpU1b = rtw_read8(Adapter, REG_PCIE_CTRL_REG_8723D + 3);
	rtw_write8(Adapter, REG_PCIE_CTRL_REG_8723D + 3, (tmpU1b | 0xF7));

	/* 20100318 Joseph: Reset interrupt migration setting when initialization. Suggested by SD1. */
	rtw_write32(Adapter, REG_INT_MIG_8723D, 0);
	pHalData->bInterruptMigration = _FALSE;

	/* 2009.10.19. Reset H2C protection register. by tynli. */
	rtw_write32(Adapter, REG_MCUTST_1_8723D, 0x0);

#if MP_DRIVER == 1
	if (Adapter->registrypriv.mp_mode == 1) {
		rtw_write32(Adapter, REG_MACID, 0x87654321);
		rtw_write32(Adapter, 0x0700, 0x87654321);
	}
#endif

