BPI-SINOVOIP/BPI-M4-bsp/phoenix/system/src/drivers/wifi/rtl8723de/hal/rtl8723d/pci/pci_halinit.c
	/* pic buffer descriptor mode: */
	/* ---- tx */
	rtw_write16(Adapter, REG_MGQ_TXBD_NUM_8723D, (pxmitpriv->txringcount[MGT_QUEUE_INX] & 0x0FFF)  | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_VOQ_TXBD_NUM_8723D, (pxmitpriv->txringcount[VO_QUEUE_INX]  & 0x0FFF)  | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_VIQ_TXBD_NUM_8723D, (pxmitpriv->txringcount[VI_QUEUE_INX]  & 0x0FFF)  | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_BEQ_TXBD_NUM_8723D, (pxmitpriv->txringcount[BE_QUEUE_INX]  & 0x0FFF)  | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_BKQ_TXBD_NUM_8723D, (pxmitpriv->txringcount[BK_QUEUE_INX]  & 0x0FFF)  | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_HI0Q_TXBD_NUM_8723D, (pxmitpriv->txringcount[HIGH_QUEUE_INX] & 0x0FFF) | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
#if 0
	rtw_write16(Adapter, REG_HI1Q_TXBD_NUM_8723D, TX_BD_NUM | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_HI2Q_TXBD_NUM_8723D, TX_BD_NUM | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_HI3Q_TXBD_NUM_8723D, TX_BD_NUM | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_HI4Q_TXBD_NUM_8723D, TX_BD_NUM | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_HI5Q_TXBD_NUM_8723D, TX_BD_NUM | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_HI6Q_TXBD_NUM_8723D, TX_BD_NUM | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
	rtw_write16(Adapter, REG_HI7Q_TXBD_NUM_8723D, TX_BD_NUM | ((TX_BUFFER_SEG_NUM << 12) & 0x3000));
#endif
	/* ---- rx. support 32 bits in linux */
#ifdef CONFIG_64BIT_DMA
	rtw_write16(Adapter, REG_RX_RXBD_NUM_8723D, (precvpriv->rxringcount & 0x0FFF) | ((TX_BUFFER_SEG_NUM << 13) & 0x6000) | 0x8000); /*using 64bit */
#else
	rtw_write16(Adapter, REG_RX_RXBD_NUM_8723D, (precvpriv->rxringcount & 0x0FFF) | ((TX_BUFFER_SEG_NUM << 13) & 0x6000)); /*using 32bit */
#endif

	/* ---- reset read/write point */
	rtw_write32(Adapter, REG_BD_RW_PTR_CLR_8723D, 0XFFFFFFFF); /*Reset read/write point*/

	pHalData->RxTag = 0;
	/* Release Pcie Interface Tx DMA. */
#if defined(USING_RX_TAG)
	rtw_write16(Adapter, REG_PCIE_CTRL_REG_8723D, 0x8000);
#else
	rtw_write16(Adapter, REG_PCIE_CTRL_REG_8723D, 0x0000);
#endif

	RTW_INFO("InitMAC_8723D() <====\n");

	return _SUCCESS;
}

/*
 *	Description:
 *		PCI configuration space read operation on RTL8723DE
 *
 *	Created by Roger, 2013.05.08.
 */
u8
hal_dbi_read_8723de(
		PADAPTER	Adapter,
		u16		Addr
)
{
	u16 ReadAddr = Addr & 0xfffc;
	u8 ret = 0, tmpU1b = 0, count = 0;

	rtw_write16(Adapter, REG_DBI_FLAG_V1_8723D, ReadAddr);
	rtw_write8(Adapter, REG_DBI_FLAG_V1_8723D + 2, 0x2);
	tmpU1b = rtw_read8(Adapter, REG_DBI_FLAG_V1_8723D + 2);
	count = 0;
	while (tmpU1b && count < 20) {
		rtw_udelay_os(10);
		tmpU1b = rtw_read8(Adapter, REG_DBI_FLAG_V1_8723D + 2);
		count++;
	}
	if (0 == tmpU1b) {
		ReadAddr = REG_DBI_RDATA_V1_8723D + Addr % 4;
		ret = rtw_read8(Adapter, ReadAddr);
	}

	return ret;
}

/*
 *	Description:
 *		PCI configuration space write operation on RTL8723DE
 *
 *	Created by Roger, 2013.05.08.
 */
void
hal_dbi_write_8723de(
		PADAPTER	Adapter,
		u16		Addr,
		u8		Data
)
{
	u8 tmpU1b = 0, count = 0;
	u16 WriteAddr = 0, Remainder = Addr % 4;

	/* Write DBI 1Byte Data */
	WriteAddr = REG_DBI_WDATA_V1_8723D + Remainder;
	rtw_write8(Adapter, WriteAddr, Data);

	/* Write DBI 2Byte Address & Write Enable */
	WriteAddr = (Addr & 0xfffc) | (BIT(0) << (Remainder + 12));
	rtw_write16(Adapter, REG_DBI_FLAG_V1_8723D, WriteAddr);

	/* Write DBI Write Flag */
	rtw_write8(Adapter, REG_DBI_FLAG_V1_8723D + 2, 0x1);

	tmpU1b = rtw_read8(Adapter, REG_DBI_FLAG_V1_8723D + 2);
	count = 0;
	while (tmpU1b && count < 20) {
		rtw_udelay_os(10);
		tmpU1b = rtw_read8(Adapter, REG_DBI_FLAG_V1_8723D + 2);
		count++;
	}
}

void
SetPciLtr_8723DE(
		PADAPTER	Adapter
	)
{
	u32			tmpU4b		= 0;

	/* Add workaround for 11n Wifi spec, set LTR idle latency to 144us for throughput test
	 * by Hana, 2015/04/17
	 */
	if (Adapter->registrypriv.wifi_spec == 1) {
		PlatformEFIOWrite4Byte(Adapter, REG_LTR_IDLE_LATENCY_V1_8723D, 0x88908890);
	} else {
		/* LTR idle latency, 0x90 for 3ms */
		PlatformEFIOWrite4Byte(Adapter, REG_LTR_IDLE_LATENCY_V1_8723D, 0x883C883C);
	}

	/* LTR active latency, 0x3c for 64us */
	PlatformEFIOWrite4Byte(Adapter, REG_LTR_ACTIVE_LATENCY_V1_8723D, 0x880B880B);

	/* for HP 8723DE device loss, suggest by Tim lin 20170322 */
	PlatformEFIOWrite4Byte(Adapter, REG_LTR_CTRL_BASIC_8723D, 0xCB004010);
	PlatformEFIOWrite4Byte(Adapter, (REG_LTR_CTRL_BASIC_8723D + 4), 0x01233425);
}

/*
 * Description: Check if PCIe DMA Tx/Rx hang.
 * The flow is provided by SD1 Alan. Added by tynli. 2013.05.03.
 */
BOOLEAN
CheckPcieDMAHang8723DE(
		PADAPTER	Adapter
)
{
	u8  u1bTmp;

	/* write reg 0x350 Bit[26]=1. Enable debug port. */
	u1bTmp = PlatformEFIORead1Byte(Adapter, REG_DBI_FLAG_V1_8723D + 3);
	if (!(u1bTmp & BIT(2))) {
		PlatformEFIOWrite1Byte(Adapter, REG_DBI_FLAG_V1_8723D + 3, (u1bTmp | BIT(2)));
		rtw_mdelay_os(100); /* Suggested by DD Justin_tsai. */
	}

	/* read reg 0x350 Bit[25] if 1 : RX hang */
	/* read reg 0x350 Bit[24] if 1 : TX hang */
	u1bTmp = PlatformEFIORead1Byte(Adapter, REG_DBI_FLAG_V1_8723D + 3);
	if ((u1bTmp & BIT(0)) || (u1bTmp & BIT(1))) {
		return TRUE;
	}

	return FALSE;
}

/* */
/* Description: Reset Pcie interface DMA. */
/* */
void
ResetPcieInterfaceDMA8723DE(
		PADAPTER		Adapter,
		BOOLEAN		bInMACPowerOn
)
{
	u8	u1Tmp;
	BOOLEAN	bReleaseMACRxPause;
	u8	BackUpPcieDMAPause;


	/* Revise Note: Follow the document "PCIe RX DMA Hang Reset Flow_v03" released by SD1 Alan. */
	/* 2013.05.07, by tynli. */

	/* 1. disable register write lock */
	/*		write 0x1C bit[1:0] = 2'h0 */
	/*		write 0xCC bit[2] = 1'b1 */
	u1Tmp = PlatformEFIORead1Byte(Adapter, REG_RSV_CTRL_8723D);
	u1Tmp &= ~(BIT(1) | BIT(0));
	PlatformEFIOWrite1Byte(Adapter, REG_RSV_CTRL_8723D, u1Tmp);
	u1Tmp = PlatformEFIORead1Byte(Adapter, REG_PMC_DBG_CTRL2_8723D);
	u1Tmp |= BIT(2);
	PlatformEFIOWrite1Byte(Adapter, REG_PMC_DBG_CTRL2_8723D, u1Tmp);

