BPI-SINOVOIP/BPI-M4-bsp/phoenix/system/src/drivers/wifi/rtl8723de/hal/rtl8723d/pci/pci_halinit.c
	/* 2. Check and pause TRX DMA */
	/*		write 0x284 bit[18] = 1'b1 */
	/*		write 0x301 = 0xFF */
	u1Tmp = PlatformEFIORead1Byte(Adapter, REG_RXDMA_CONTROL_8723D);
	if (u1Tmp & BIT(2)) {
		/* Already pause before the function for another purpose. */
		bReleaseMACRxPause = FALSE;
	} else {
		PlatformEFIOWrite1Byte(Adapter, REG_RXDMA_CONTROL_8723D, (u1Tmp | BIT(2)));
		bReleaseMACRxPause = TRUE;
	}

	BackUpPcieDMAPause = PlatformEFIORead1Byte(Adapter,	REG_PCIE_CTRL_REG_8723D + 1);
	if (BackUpPcieDMAPause != 0xFF)
		PlatformEFIOWrite1Byte(Adapter, REG_PCIE_CTRL_REG_8723D + 1, 0xFF);

	if (bInMACPowerOn) {
		/* 3. reset TRX function */
		/*		write 0x100 = 0x00 */
		PlatformEFIOWrite1Byte(Adapter, REG_CR, 0);
	}

	/* 4. Reset PCIe DMA */
	/*		write 0x003 bit[0] = 0 */
	u1Tmp = PlatformEFIORead1Byte(Adapter, REG_SYS_FUNC_EN + 1);
	u1Tmp &= ~(BIT(0));
	PlatformEFIOWrite1Byte(Adapter, REG_SYS_FUNC_EN + 1, u1Tmp);

	/* 5. Enable PCIe DMA */
	/*		write 0x003 bit[0] = 1 */
	u1Tmp = PlatformEFIORead1Byte(Adapter, REG_SYS_FUNC_EN + 1);
	u1Tmp |= BIT(0);
	PlatformEFIOWrite1Byte(Adapter, REG_SYS_FUNC_EN + 1, u1Tmp);

	if (bInMACPowerOn) {
		/* 6. enable TRX function */
		/* write 0x100 = 0xFF */
		PlatformEFIOWrite1Byte(Adapter, REG_CR, 0xFF);

		/* We should init LLT & RQPN and prepare Tx/Rx descrptor address later */
		/* because MAC function is reset. */
	}

	/* 7. Restore PCIe autoload down bit */
	/* write 0xF8 bit[17] = 1'b1 */
	u1Tmp = PlatformEFIORead1Byte(Adapter, REG_MAC_PHY_CTRL_NORMAL + 2);
	u1Tmp |= BIT(1);
	PlatformEFIOWrite1Byte(Adapter, REG_MAC_PHY_CTRL_NORMAL + 2, u1Tmp);

	/* In MAC power on state, BB and RF maybe in ON state, if we release TRx DMA here */
	/* it will cause packets to be started to Tx/Rx, so we release Tx/Rx DMA later. */
	if (!bInMACPowerOn) {
		/* 8. release TRX DMA */
		/* write 0x284 bit[18] = 1'b0 */
		/* write 0x301 = 0x00 */
		if (bReleaseMACRxPause) {
			u1Tmp = PlatformEFIORead1Byte(Adapter, REG_RXDMA_CONTROL_8723D);
			PlatformEFIOWrite1Byte(Adapter, REG_RXDMA_CONTROL_8723D, (u1Tmp & ~BIT(2)));
		}
		PlatformEFIOWrite1Byte(Adapter, REG_PCIE_CTRL_REG_8723D + 1, BackUpPcieDMAPause);
	}

	/* 9. lock system register */
	/*		write 0xCC bit[2] = 1'b0 */
	u1Tmp = PlatformEFIORead1Byte(Adapter, REG_PMC_DBG_CTRL2_8723D);
	u1Tmp &= ~(BIT(2));
	PlatformEFIOWrite1Byte(Adapter, REG_PMC_DBG_CTRL2_8723D, u1Tmp);

}
void
PHY_InitAntennaSelection8723DE(
		PADAPTER Adapter
)
{

}

static void _InitBBRegBackup_8723DE(PADAPTER	Adapter)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);

	/* For Channel 1~11 (Default Value)*/
	pHalData->RegForRecover[0].offset = rCCK0_TxFilter2;
	pHalData->RegForRecover[0].value =
		phy_query_bb_reg(Adapter,
			       pHalData->RegForRecover[0].offset, bMaskDWord);

	pHalData->RegForRecover[1].offset = rCCK0_DebugPort;
	pHalData->RegForRecover[1].value =
		phy_query_bb_reg(Adapter,
			       pHalData->RegForRecover[1].offset, bMaskDWord);

	pHalData->RegForRecover[2].offset = 0xAAC;
	pHalData->RegForRecover[2].value =
		phy_query_bb_reg(Adapter,
			       pHalData->RegForRecover[2].offset, bMaskDWord);
#if 0
	/* For 20 MHz	(Default Value)*/
	pHalData->RegForRecover[2].offset = rBBrx_DFIR;
	pHalData->RegForRecover[2].value = phy_query_bb_reg(Adapter, pHalData->RegForRecover[2].offset, bMaskDWord);

	pHalData->RegForRecover[3].offset = rOFDM0_XATxAFE;
	pHalData->RegForRecover[3].value = phy_query_bb_reg(Adapter, pHalData->RegForRecover[3].offset, bMaskDWord);

	pHalData->RegForRecover[4].offset = 0x1E;
	pHalData->RegForRecover[4].value = phy_query_rf_reg(Adapter, RF_PATH_A, pHalData->RegForRecover[4].offset, bRFRegOffsetMask);
#endif
}

/* Set CCK and OFDM Block "ON" */
static void _BBTurnOnBlock(PADAPTER padapter)
{
#if (DISABLE_BB_RF)
	return;
#endif

	phy_set_bb_reg(padapter, rFPGA0_RFMOD, bCCKEn, 0x1);
	phy_set_bb_reg(padapter, rFPGA0_RFMOD, bOFDMEn, 0x1);
}

static u32 rtl8723de_hal_init(PADAPTER Adapter)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(Adapter);
	struct pwrctrl_priv		*pwrpriv = adapter_to_pwrctl(Adapter);
	struct registry_priv  *registry_par = &Adapter->registrypriv;
	u32	rtStatus = _SUCCESS;
	u8	tmpU1b, u1bRegCR;
	u32 u4Tmp;
	u32	i;
	BOOLEAN bSupportRemoteWakeUp;
	u32	NavUpper = WiFiNavUpperUs;
#if (defined(CONFIG_ANT_DETECTION))
	struct dm_struct			*pDM_Odm = &pHalData->odmpriv;
#endif


	/* */
	/* No I/O if device has been surprise removed */
	/* */
	if (rtw_is_surprise_removed(Adapter)) {
		RTW_INFO("rtl8723de_hal_init(): bSurpriseRemoved!\n");
		return _SUCCESS;
	}

	Adapter->init_adpt_in_progress = _TRUE;
	RTW_INFO("=======>rtl8723de_hal_init()\n");

	u1bRegCR = rtw_read8(Adapter, REG_CR);
	RTW_INFO(" power-on :REG_CR 0x100=0x%02x.\n", u1bRegCR);
	if (/*(tmpU1b&BIT3) && */ (u1bRegCR != 0 && u1bRegCR != 0xEA)) {
		/* pHalData->bMACFuncEnable = TRUE; */
		RTW_INFO(" MAC has already power on.\n");
	} else {
		/* pHalData->bMACFuncEnable = FALSE; */
		/* Set FwPSState to ALL_ON mode to prevent from the I/O be return because of 32k */
		/* state which is set before sleep under wowlan mode. 2012.01.04. by tynli. */
		/* pHalData->FwPSState = FW_PS_STATE_ALL_ON_88E; */
	}

	if (CheckPcieDMAHang8723DE(Adapter)) {
		/* ResetPcieInterfaceDMA8723DE(Adapter, pHalData->bMACFuncEnable); */
		ResetPcieInterfaceDMA8723DE(Adapter, (u1bRegCR != 0 && u1bRegCR != 0xEA));
		/* Release pHalData->bMACFuncEnable here because it will reset MAC in ResetPcieInterfaceDMA */
		/* function such that we need to allow LLT to be initialized in later flow. */
		/* pHalData->bMACFuncEnable = FALSE; */
	}

	/*if(pHalData->bMACFuncEnable == FALSE)*/
	{
		u8 u1Tmp;

		u1Tmp = PlatformEFIORead1Byte(Adapter, REG_HCI_OPT_CTRL_8723D+1);
		PlatformEFIOWrite1Byte(Adapter, REG_HCI_OPT_CTRL_8723D+1, (u1Tmp|BIT0));/*Disable USB Suspend Signal*/
	}

	/* */
	/* 1. MAC Initialize */
	/* */
	rtStatus = InitMAC_8723DE(Adapter);
	rtw_write8(Adapter, REG_SECONDARY_CCA_CTRL_8723D, 0x03);
	rtw_write8(Adapter, 0x976, 0);	/* hpfan_todo: 2nd CCA related */
	if (rtStatus != _SUCCESS) {
		RTW_INFO("Init MAC failed\n");
		return rtStatus;
	}

	/* <Kordan> InitHalDm should be put ahead of FirmwareDownload. (HWConfig flow: FW->MAC->-BB->RF) */
	/*rtl8723d_InitHalDm(Adapter);*/

#if 0	/* This statement is put on ex_halbtc8723d2ant_pre_load_firmware() */
	/*
		To inform FW about:
		bit0: "0" for no antenna inverse; "1" for antenna inverse
		bit1: "0" for internal switch; "1" for external switch
		bit2: "0" for one antenna; "1" for two antenna
	*/
	tmpU1b = 0;
	if (pHalData->EEPROMBluetoothAntNum == Ant_x2)
		tmpU1b |= BIT(2); /* two antenna case */

	rtw_write8(Adapter, 0x3E0, tmpU1b);
#endif

