BPI-SINOVOIP/BPI-M4-bsp/phoenix/system/src/drivers/wifi/rtl8723de/hal/rtl8723d/pci/pci_halinit.c
#if HAL_FW_ENABLE
	if (Adapter->registrypriv.mp_mode == 0
		#if defined(CONFIG_MP_INCLUDED) && defined(CONFIG_RTW_CUSTOMER_STR)
		|| Adapter->registrypriv.mp_customer_str
		#endif
	) {
		tmpU1b = rtw_read8(Adapter, REG_SYS_CFG);
		rtw_write8(Adapter, REG_SYS_CFG, tmpU1b & 0x7F);

		rtStatus = rtl8723d_FirmwareDownload(Adapter, _FALSE);

		if (rtStatus != _SUCCESS) {
			RTW_INFO("FwLoad failed\n");
			rtStatus = _SUCCESS;
			pHalData->bFWReady = _FALSE;
			pHalData->fw_ractrl = _FALSE;
		} else {
			RTW_INFO("FwLoad SUCCESSFULLY!!!\n");
			pHalData->bFWReady = _TRUE;
			pHalData->fw_ractrl = _TRUE;
		}
	}
#endif

	if (pHalData->AMPDUBurstMode)
		rtw_write8(Adapter, REG_AMPDU_BURST_MODE_8723D, 0x7F);

	pHalData->current_channel = 0;/* set 0 to trigger switch correct channel */

	/* We should call the function before MAC/BB configuration. */
	PHY_InitAntennaSelection8723DE(Adapter);

	/* */
	/* 2. Initialize MAC/PHY Config by MACPHY_reg.txt */
	/* */
#if (HAL_MAC_ENABLE == 1)
	RTW_INFO("8723D MAC Config Start!\n");
	rtStatus = PHY_MACConfig8723D(Adapter);
	if (rtStatus != _SUCCESS) {
		RTW_INFO("8723D MAC Config failed\n");
		return rtStatus;
	}
	RTW_INFO("8723D MAC Config Finished!\n");

	/* without this statement, RCR doesn't take effect so that it will show 'validate_recv_ctrl_frame fail'. */
	rtw_write32(Adapter, REG_RCR, rtw_read32(Adapter, REG_RCR) & ~(RCR_ADF));

	/* Configure TX HIQ constraint */
	rtw_write8(Adapter, 0x5a7, rtw_read8(Adapter, 0x5a7) | 0x01);
#endif	/*  #if (HAL_MAC_ENABLE == 1) */

	/* */
	/* 3. Initialize BB After MAC Config PHY_reg.txt, AGC_Tab.txt */
	/* */
#if (HAL_BB_ENABLE == 1)
	RTW_INFO("BB Config Start!\n");
	rtStatus = PHY_BBConfig8723D(Adapter);
	if (rtStatus != _SUCCESS) {
		RTW_INFO("BB Config failed\n");
		return rtStatus;
	}

	RTW_INFO("BB Config Finished!\n");
#endif	/*  #if (HAL_BB_ENABLE == 1) */

	/* */
	/* 4. Initiailze RF RAIO_A.txt RF RAIO_B.txt */
	/* */
#if (HAL_RF_ENABLE == 1)
	RTW_INFO("RF Config started!\n");
	rtStatus = PHY_RFConfig8723D(Adapter);
	if (rtStatus != _SUCCESS) {
		RTW_INFO("RF Config failed\n");
		return rtStatus;
	}

	/*---- Set CCK and OFDM Block "ON"----*/
	phy_set_bb_reg(Adapter, rFPGA0_RFMOD, bCCKEn, 0x1);
	phy_set_bb_reg(Adapter, rFPGA0_RFMOD, bOFDMEn, 0x1);

	RTW_INFO("RF Config Finished!\n");

	pHalData->RfRegChnlVal[0] = phy_query_rf_reg(Adapter, 0, RF_CHNLBW, bRFRegOffsetMask);
	pHalData->RfRegChnlVal[1] = phy_query_rf_reg(Adapter, 1, RF_CHNLBW, bRFRegOffsetMask);
	/* Defalut BW should be 20MH at first for the value. because HAL bandwidh defalut = 20MH. */
	/*
	pHalData->RfRegChnlVal[0] &= 0xFFF03FF;
	pHalData->RfRegChnlVal[0] |= (BIT(10) | BIT(11));
	*/

#endif	/*  #if (HAL_RF_ENABLE == 1) */

	_InitBBRegBackup_8723DE(Adapter);

	_InitMacAPLLSetting_8723D(Adapter);

	/* 3 Set Hardware(MAC default setting.) */
	HwConfigureRTL8723DE(Adapter);

	rtw_hal_set_chnl_bw(Adapter, Adapter->registrypriv.channel,
		CHANNEL_WIDTH_20, HAL_PRIME_CHNL_OFFSET_DONT_CARE, HAL_PRIME_CHNL_OFFSET_DONT_CARE);

	/* We should set pHalData->bMACFuncEnable to TRUE after LLT initialize and Fw download */
	/* and before GPIO detect. by tynli. 2011.05.27. */
	/* pHalData->bMACFuncEnable = _TRUE; */

	_BBTurnOnBlock(Adapter);

	/* 3Security related */
	/* ----------------------------------------------------------------------------- */
	/* Set up security related. 070106, by rcnjko: */
	/* 1. Clear all H/W keys. */
	/* ----------------------------------------------------------------------------- */
	invalidate_cam_all(Adapter);

	/* Joseph debug: MAC_SEC_EN need to be set */
	rtw_write8(Adapter, REG_CR + 1, (rtw_read8(Adapter, REG_CR + 1) | BIT(1)));

	/* 2======================================================= */
	/* RF Power Save */
	/* 2======================================================= */
	/* Fix the bug that Hw/Sw radio off before S3/S4, the RF off action will not be executed */
	/* in MgntActSet_RF_State() after wake up, because the value of pHalData->eRFPowerState */
	/* is the same as eRfOff, we should change it to eRfOn after we config RF parameters. */
	/* Added by tynli. 2010.03.30. */
	pwrpriv->rf_pwrstate = rf_on;

	/* if(pPSC->bGpioRfSw) */
	if (0) {
		tmpU1b = rtw_read8(Adapter, 0x60);
		pwrpriv->rfoff_reason |= (tmpU1b & BIT(1)) ? 0 : RF_CHANGE_BY_HW;
	}

	pwrpriv->rfoff_reason |= (pwrpriv->reg_rfoff) ? RF_CHANGE_BY_SW : 0;

	if (pwrpriv->rfoff_reason & RF_CHANGE_BY_HW)
		pwrpriv->b_hw_radio_off = _TRUE;

	if (pwrpriv->rfoff_reason > RF_CHANGE_BY_PS) {
		/* H/W or S/W RF OFF before sleep. */
		RTW_INFO("InitializeAdapter8188EE(): Turn off RF for RfOffReason(%d) ----------\n", pwrpriv->rfoff_reason);
		/* MgntActSet_RF_State(Adapter, rf_off, pwrpriv->rfoff_reason, _TRUE); */
	} else {
		pwrpriv->rf_pwrstate = rf_on;
		pwrpriv->rfoff_reason = 0;

		RTW_INFO("InitializeAdapter8723DE(): Turn on  ----------\n");
	}

	rtl8723d_InitAntenna_Selection(Adapter);

	/* Fix the bug that when the system enters S3/S4 then tirgger HW radio off, after system */
	/* wakes up, the scan OID will be set from upper layer, but we still in RF OFF state and scan */
	/* list is empty, such that the system might consider the NIC is in RF off state and will wait */
	/* for several seconds (during this time the scan OID will not be set from upper layer anymore) */
	/* even though we have already HW RF ON, so we tell the upper layer our RF state here. */
	/* Added by tynli. 2010.04.01. */
	/* DrvIFIndicateCurrentPhyStatus(Adapter); */

	if (Adapter->registrypriv.hw_wps_pbc) {
		tmpU1b = rtw_read8(Adapter, GPIO_IO_SEL);
		tmpU1b &= ~(HAL_8192C_HW_GPIO_WPS_BIT);
		rtw_write8(Adapter, GPIO_IO_SEL, tmpU1b);	/* enable GPIO[2] as input mode */
	}

	/* */
	/* Execute TX power tracking later */
	/* */

	pHalData->pci_backdoor_ctrl = registry_par->pci_aspm_config;

	rtw_pci_aspm_config(Adapter);

	SetPciLtr_8723DE(Adapter);

	/* Init BT hw config. */

	rtl8723d_InitHalDm(Adapter);

	Adapter->init_adpt_in_progress = _FALSE;

	/* enable tx DMA to drop the redundate data of packet */
	rtw_write16(Adapter, REG_TXDMA_OFFSET_CHK, (rtw_read16(Adapter, REG_TXDMA_OFFSET_CHK) | DROP_DATA_EN));

