BPI-SINOVOIP/BPI-M4-bsp/phoenix/system/src/drivers/wifi/rtl8723de/hal/rtl8723d/pci/pci_halinit.c
}

/*
 *	Description:
 *		Change default setting of specified variable.
 */
u8
SetHalDefVar8723DE(
		PADAPTER				Adapter,
		HAL_DEF_VARIABLE		eVariable,
		void						*pValue
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u8			bResult = _SUCCESS;

	switch (eVariable) {
	case HAL_DEF_PCI_SUUPORT_L1_BACKDOOR:
		pHalData->bSupportBackDoor = *((PBOOLEAN)pValue);
		break;
	default:
		SetHalDefVar8723D(Adapter, eVariable, pValue);
		break;
	}

	return bResult;
}

/*
 *	Description:
 *		Query setting of specified variable.
 */
u8
GetHalDefVar8723DE(
		PADAPTER				Adapter,
		HAL_DEF_VARIABLE		eVariable,
		void						*pValue
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u8			bResult = _SUCCESS;

	switch (eVariable) {
	case HAL_DEF_PCI_SUUPORT_L1_BACKDOOR:
		*((PBOOLEAN)pValue) = pHalData->bSupportBackDoor;
		break;

	case HAL_DEF_PCI_AMD_L1_SUPPORT:
		*((PBOOLEAN)pValue) = _TRUE;/* Support L1 patch on AMD platform in default, added by Roger, 2012.04.30. */
		break;

#ifdef CONFIG_ANTENNA_DIVERSITY
	case HAL_DEF_IS_SUPPORT_ANT_DIV:
		*((u8 *)pValue) = (pHalData->AntDivCfg == 0) ? _FALSE : _TRUE;
		break;
#endif
	case HAL_DEF_DRVINFO_SZ:
		*((u32 *)pValue) = DRVINFO_SZ;
		break;

	case HW_VAR_MAX_RX_AMPDU_FACTOR:
		*((HT_CAP_AMPDU_FACTOR *)pValue) = MAX_AMPDU_FACTOR_64K;
		break;

	default:
		GetHalDefVar8723D(Adapter, eVariable, pValue);
		break;
	}

	return bResult;
}

static void rtl8723de_init_default_value(_adapter *padapter)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);

	rtl8723d_init_default_value(padapter);

	pHalData->CurrentWirelessMode = WIRELESS_MODE_AUTO;
	pHalData->bDefaultAntenna = 1;

	/* */
	/* Set TCR-Transmit Control Register. The value is set in InitializeAdapter8190Pci() */
	/* */
	pHalData->TransmitConfig = CFENDFORM | BIT(12) | BIT(13);

	/* */
	/* Set RCR-Receive Control Register . The value is set in InitializeAdapter8190Pci(). */
	/* */
	pHalData->ReceiveConfig = (
					  /*RCR_APPFCS			|*/
					  RCR_APP_MIC			|
					  RCR_APP_ICV			|
					  RCR_APP_PHYST_RXFF	|
					  /*RCR_VHT_DACK	|*/
					  RCR_HTC_LOC_CTRL	|
					  RCR_AMF				|
					  /*RCR_ACF				|*/
		/*RCR_ADF				|*/ /* Note: This bit controls the PS-Poll packet filter. */
					  /*RCR_AICV			|*/
					  /*RCR_ACRC32			|*/
					  RCR_CBSSID_BCN		|
					  RCR_CBSSID_DATA		|
					  RCR_AB				|
					  RCR_AM				|
					  RCR_APM				|
					  0);


	/* */
	/* Set Interrupt Mask Register */
	/* */
	pHalData->IntrMaskDefault[0]	= (u32)(
			IMR_PSTIMEOUT_8723D		|
			/* IMR_GTINT4_8723D			| */
			IMR_GTINT3_8723D			|
			IMR_TXBCN0ERR_8723D		|
			IMR_TXBCN0OK_8723D		|
			IMR_BCNDMAINT0_8723D	|
			IMR_HSISR_IND_ON_INT_8723D	|
			IMR_C2HCMD_8723D		|
			/* IMR_CPWM_8723D			| */
			IMR_HIGHDOK_8723D		|
			IMR_MGNTDOK_8723D		|
			IMR_BKDOK_8723D			|
			IMR_BEDOK_8723D			|
			IMR_VIDOK_8723D			|
			IMR_VODOK_8723D			|
			IMR_RDU_8723D			|
			IMR_ROK_8723D			|
			0);
	pHalData->IntrMaskDefault[1] = (u32)(
					       IMR_RXFOVW_8723D		|
					       IMR_TXFOVW_8723D		|
					       0);

	/* 2012/03/27 hpfan Add for win8 DTM DPC ISR test */
	pHalData->IntrMaskReg[0]	=	(u32)(
			IMR_RDU_8723D		|
			IMR_PSTIMEOUT_8723D	|
			0);
	pHalData->IntrMaskReg[1]	=	(u32)(
			IMR_C2HCMD_8723D		|
			0);

	/* if (padapter->bUseThreadHandleInterrupt) */
	/* { */
	/*	pHalData->IntrMask[0] = pHalData->IntrMaskReg[0]; */
	/*	pHalData->IntrMask[1] = pHalData->IntrMaskReg[1]; */
	/* } */
	/* else */
	{
		pHalData->IntrMask[0] = pHalData->IntrMaskDefault[0];
		pHalData->IntrMask[1] = pHalData->IntrMaskDefault[1];
	}


	if (1) {/* IS_HARDWARE_TYPE_8723DE(padapter)) */

		pHalData->SysIntrMask[0] = (u32)(
						   HSIMR_PDN_INT_EN		|
						   HSIMR_RON_INT_EN		|
						   0);
	}
}

void rtl8723de_set_hal_ops(_adapter *padapter)
{
	struct hal_ops	*pHalFunc = &padapter->hal_func;


	rtl8723d_set_hal_ops(pHalFunc);

	pHalFunc->hal_power_on = &_InitPowerOn_8723DE;
	pHalFunc->hal_power_off = &hal_poweroff_8723DE;
	pHalFunc->hal_init = &rtl8723de_hal_init;
	pHalFunc->hal_deinit = &rtl8723de_hal_deinit;

	pHalFunc->inirp_init = &rtl8723de_init_desc_ring;
	pHalFunc->inirp_deinit = &rtl8723de_free_desc_ring;
	pHalFunc->irp_reset = &rtl8723de_reset_desc_ring;

	pHalFunc->init_xmit_priv = &rtl8723de_init_xmit_priv;
	pHalFunc->free_xmit_priv = &rtl8723de_free_xmit_priv;

	pHalFunc->init_recv_priv = &rtl8723de_init_recv_priv;
	pHalFunc->free_recv_priv = &rtl8723de_free_recv_priv;
#ifdef CONFIG_RTW_SW_LED
	pHalFunc->InitSwLeds = &rtl8723de_InitSwLeds;
	pHalFunc->DeInitSwLeds = &rtl8723de_DeInitSwLeds;
#endif/* CONFIG_RTW_SW_LED */

	pHalFunc->init_default_value = &rtl8723de_init_default_value;
	pHalFunc->intf_chip_configure = &rtl8723de_interface_configure;
	pHalFunc->read_adapter_info = &ReadAdapterInfo8723DE;

	pHalFunc->enable_interrupt = &EnableInterrupt8723DE;
	pHalFunc->disable_interrupt = &DisableInterrupt8723DE;
	pHalFunc->interrupt_handler = &rtl8723de_interrupt;

	pHalFunc->set_hw_reg_handler = &SetHwReg8723DE;
	pHalFunc->GetHwRegHandler = &GetHwReg8723DE;
	pHalFunc->get_hal_def_var_handler = &GetHalDefVar8723DE;
	pHalFunc->SetHalDefVarHandler = &SetHalDefVar8723DE;

	pHalFunc->hal_xmit = &rtl8723de_hal_xmit;
	pHalFunc->mgnt_xmit = &rtl8723de_mgnt_xmit;
	pHalFunc->hal_xmitframe_enqueue = &rtl8723de_hal_xmitframe_enqueue;

#ifdef CONFIG_HOSTAPD_MLME
	pHalFunc->hostap_mgnt_xmit_entry = &rtl8723de_hostap_mgnt_xmit_entry;
#endif

#ifdef CONFIG_XMIT_THREAD_MODE
	pHalFunc->xmit_thread_handler = &rtl8723de_xmit_buf_handler;
#endif
	pHalFunc->hal_set_l1ssbackdoor_handler = rtw_pci_aspm_config_l1off_general;

	pHalFunc->unmap_beacon_icf = &rtl8723de_unmap_beacon_icf;

}
